aws-samples/aws-stm32-ml-at-edge-accelerator/stm32/Middleware/ARM/trusted-firmware-m/platform/ext/target/cypress/psoc64/libs/mtb-pdl-cat1/devices/COMPONENT_CAT1A/include/cys0644abzi_s2d44.h
/*******************************************************************************
*                                     SAR
*******************************************************************************/

#define SAR_BASE                                0x409D0000UL
#define SAR                                     ((SAR_Type*) SAR_BASE)                                            /* 0x409D0000 */

/*******************************************************************************
*                                     PASS
*******************************************************************************/

#define PASS_BASE                               0x409F0000UL
#define PASS                                    ((PASS_Type*) PASS_BASE)                                          /* 0x409F0000 */
#define PASS_AREF                               ((PASS_AREF_Type*) &PASS->AREF)                                   /* 0x409F0E00 */

/*******************************************************************************
*                                     PDM
*******************************************************************************/

#define PDM0_BASE                               0x40A00000UL
#define PDM0                                    ((PDM_Type*) PDM0_BASE)                                           /* 0x40A00000 */

/*******************************************************************************
*                                     I2S
*******************************************************************************/

#define I2S0_BASE                               0x40A10000UL
#define I2S1_BASE                               0x40A11000UL
#define I2S0                                    ((I2S_Type*) I2S0_BASE)                                           /* 0x40A10000 */
#define I2S1                                    ((I2S_Type*) I2S1_BASE)                                           /* 0x40A11000 */

/** \} CYS0644ABZI-S2D44 */

#endif /* _CYS0644ABZI_S2D44_H_ */


/* [] END OF FILE */
